In [113]:
import warnings
warnings.filterwarnings('ignore')
import pandas as pd
import numpy as np

In [114]:
df = pd.read_csv('Used_Bikes.csv')

In [115]:
df.head()

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

In [116]:
df.isnull().sum()

bike_name     0
price         0
city          0
kms_driven    0
owner         0
age           0
power         0
brand         0
dtype: int64

In [117]:
df.duplicated().sum()

25324

In [118]:
df.drop_duplicates(inplace=True)

In [119]:
df.dtypes

bike_name      object
price         float64
city           object
kms_driven    float64
owner          object
age           float64
power         float64
brand          object
dtype: object

In [120]:
cat_cols = df.select_dtypes(include='O')
cat_cols.head()

                              bike_name       city        owner          brand
0    TVS Star City Plus Dual Tone 110cc  Ahmedabad  First Owner            TVS
1           Royal Enfield Classic 350cc      Delhi  First Owner  Royal Enfield
2                  Triumph Daytona 675R      Delhi  First Owner        Triumph
3                  TVS Apache RTR 180cc  Bangalore  First Owner            TVS
4  Yamaha FZ S V 2.0 150cc-Ltd. Edition  Bangalore  First Owner         Yamaha

In [121]:
num_cols = df.select_dtypes(exclude='O')
num_cols.head()

      price  kms_driven  age  power
0   35000.0     17654.0  3.0  110.0
1  119900.0     11000.0  4.0  350.0
2  600000.0       110.0  8.0  675.0
3   65000.0     16329.0  4.0  180.0
4   80000.0     10000.0  3.0  150.0

In [122]:
cat_cols = cat_cols.drop(['bike_name','city'],axis=1)
cat_cols.head(2)

         owner          brand
0  First Owner            TVS
1  First Owner  Royal Enfield

In [123]:
cat_cols['owner'].value_counts()

owner
First Owner             6642
Second Owner             588
Third Owner               84
Fourth Owner Or More      10
Name: count, dtype: int64

In [124]:
dt = {'First Owner':1, 'Second Owner':2, 'Third Owner':3, 'Fourth Owner Or More':4}
dt

{'First Owner': 1,
 'Second Owner': 2,
 'Third Owner': 3,
 'Fourth Owner Or More': 4}

In [125]:
cat_cols['owner']

0       First Owner
1       First Owner
2       First Owner
3       First Owner
4       First Owner
           ...
9362    First Owner
9369    First Owner
9370    First Owner
9371    First Owner
9372    First Owner
Name: owner, Length: 7324, dtype: object

In [126]:
cat_cols['owner'] = cat_cols['owner'].map(dt)

In [127]:
cat_cols['brand'].value_counts()

brand
Bajaj              2081
Royal Enfield      1346
Hero               1142
Honda               676
Yamaha              651
TVS                 481
KTM                 375
Suzuki              203
Harley-Davidson      91
Kawasaki             61
Hyosung              53
Mahindra             50
Benelli              46
Triumph              21
Ducati               20
BMW                  10
Jawa                  7
Indian                3
MV                    3
Rajdoot               1
LML                   1
Yezdi                 1
Ideal                 1
Name: count, dtype: int64

In [128]:
unique_brands = cat_cols['brand'].unique()
unique_brands

array(['TVS', 'Royal Enfield', 'Triumph', 'Yamaha', 'Honda', 'Hero',
       'Bajaj', 'Suzuki', 'Benelli', 'KTM', 'Mahindra', 'Kawasaki',
       'Ducati', 'Hyosung', 'Harley-Davidson', 'Jawa', 'BMW', 'Indian',
       'Rajdoot', 'LML', 'Yezdi', 'MV', 'Ideal'], dtype=object)

In [129]:
num=1
dt1={}
for i in unique_brands:
    dt1[i]=num
    num+=1

In [130]:
dt1

{'TVS': 1,
 'Royal Enfield': 2,
 'Triumph': 3,
 'Yamaha': 4,
 'Honda': 5,
 'Hero': 6,
 'Bajaj': 7,
 'Suzuki': 8,
 'Benelli': 9,
 'KTM': 10,
 'Mahindra': 11,
 'Kawasaki': 12,
 'Ducati': 13,
 'Hyosung': 14,
 'Harley-Davidson': 15,
 'Jawa': 16,
 'BMW': 17,
 'Indian': 18,
 'Rajdoot': 19,
 'LML': 20,
 'Yezdi': 21,
 'MV': 22,
 'Ideal': 23}

In [131]:
cat_cols['brand'] = cat_cols['brand'].map(dt1)

In [132]:
cat_cols

      owner  brand
0         1      1
1         1      2
2         1      3
3         1      1
4         1      4
...     ...    ...
9362      1      6
9369      1      7
9370      1     15
9371      1      7
9372      1      7

[7324 rows x 2 columns]

In [140]:
df2 = pd.concat([cat_cols,num_cols],axis=1)
df2.head()

   owner  brand     price  kms_driven  age  power
0      1      1   35000.0     17654.0  3.0  110.0
1      1      2  119900.0     11000.0  4.0  350.0
2      1      3  600000.0       110.0  8.0  675.0
3      1      1   65000.0     16329.0  4.0  180.0
4      1      4   80000.0     10000.0  3.0  150.0

In [144]:
x = df2.drop('price',axis=1)
y=df2[['price']]

In [147]:
from sklearn.model_selection import train_test_split

In [148]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.2)

In [152]:
x_train

      owner  brand  kms_driven  age  power
4859      1      4     24000.0  9.0  150.0
1819      1      7     12193.0  2.0  100.0
2050      1      2     50000.0  5.0  500.0
8561      1     10      4500.0  5.0  390.0
37        1      5     43000.0  6.0  150.0
...     ...    ...         ...  ...    ...
5934      1     10     29500.0  7.0  200.0
7306      1      1     21578.0  6.0  180.0
7434      1      4     29800.0  7.0  150.0
7177      1      4     20199.0  7.0  150.0
3388      1     10     10838.0  4.0  390.0

[5859 rows x 5 columns]

In [154]:
from sklearn.linear_model import LinearRegression

In [155]:
lr = LinearRegression()

In [156]:
lr.fit(x_train,y_train)

LinearRegression()

In [177]:
training_score = lr.score(x_train, y_train)
testing_score = lr.score(x_test, y_test)

print(f"Training score: {training_score:.2f}")
print(f"Testing score: {testing_score:.2f}")

Training score: 0.72
Testing score: 0.74

In [178]:
prediction = lr.predict(x_test)

In [179]:
y_test['predicted_price'] = prediction

In [183]:
y_test

        price  predicted_price    difference
6646  22000.0     20259.402594   1740.597406
7275  30000.0     21848.364209   8151.635791
9242  66000.0     14661.538766  51338.461234
100   68000.0     92424.925170 -24424.925170
6     85000.0     54900.284107  30099.715893
...       ...              ...           ...
4252  22950.0     48039.001580 -25089.001580
4833  28000.0       654.750488  27345.249512
2923  35000.0     17544.907451  17455.092549
8572  72000.0     55617.633374  16382.366626
3397  44000.0     80835.706687 -36835.706687

[1465 rows x 3 columns]

In [181]:
y_test['difference'] = y_test['price']-y_test['predicted_price']

In [182]:
y_test

        price  predicted_price    difference
6646  22000.0     20259.402594   1740.597406
7275  30000.0     21848.364209   8151.635791
9242  66000.0     14661.538766  51338.461234
100   68000.0     92424.925170 -24424.925170
6     85000.0     54900.284107  30099.715893
...       ...              ...           ...
4252  22950.0     48039.001580 -25089.001580
4833  28000.0       654.750488  27345.249512
2923  35000.0     17544.907451  17455.092549
8572  72000.0     55617.633374  16382.366626
3397  44000.0     80835.706687 -36835.706687

[1465 rows x 3 columns]

In [184]:
import joblib

In [185]:
joblib.dump(lr,'linear_regression_model.lb')

['linear_regression_model.lb']